docs/20231201 - AKS RKE2 comparison results/benchmark_AKS01_rbac.authorization.k8s.io.rolebindings.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m00.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m01.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
list   [   0% ] 1 VUs  0d00h00m02.9s/24h0m0s  00/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m03.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m04.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m05.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m06.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
list   [   7% ] 1 VUs  0d00h00m07.9s/24h0m0s  02/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m08.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m09.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
list   [  10% ] 1 VUs  0d00h00m10.9s/24h0m0s  03/30 iters, 30 per VU

running (0d00h00m12.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m11.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m13.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m12.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m14.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m13.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m15.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m14.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m16.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m15.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m17.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
list   [  17% ] 1 VUs  0d00h00m16.9s/24h0m0s  05/30 iters, 30 per VU

running (0d00h00m18.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m17.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m19.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m18.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m20.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m19.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m21.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m20.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m22.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m21.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m23.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
list   [  23% ] 1 VUs  0d00h00m22.9s/24h0m0s  07/30 iters, 30 per VU

running (0d00h00m24.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m23.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m25.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m24.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m26.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m25.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m27.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m26.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m28.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m27.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m29.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
list   [  30% ] 1 VUs  0d00h00m28.9s/24h0m0s  09/30 iters, 30 per VU

running (0d00h00m30.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m29.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m31.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m30.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m32.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m31.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m33.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h00m32.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h00m34.0s), 1/1 VUs, 11 complete and 0 interrupted iterations
list   [  37% ] 1 VUs  0d00h00m33.9s/24h0m0s  11/30 iters, 30 per VU

running (0d00h00m35.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m34.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m36.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m35.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m37.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m36.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m38.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h00m37.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h00m39.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h00m38.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h00m40.0s), 1/1 VUs, 13 complete and 0 interrupted iterations
list   [  43% ] 1 VUs  0d00h00m39.9s/24h0m0s  13/30 iters, 30 per VU

running (0d00h00m41.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m40.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m42.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m41.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m43.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m42.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m44.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m43.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m45.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m44.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m46.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m45.9s/24h0m0s  15/30 iters, 30 per VU

running (0d00h00m47.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h00m46.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h00m48.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h00m47.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h00m49.0s), 1/1 VUs, 16 complete and 0 interrupted iterations
list   [  53% ] 1 VUs  0d00h00m48.9s/24h0m0s  16/30 iters, 30 per VU

running (0d00h00m50.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m49.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m51.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m50.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m52.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m51.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m53.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m52.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m54.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m53.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m55.0s), 1/1 VUs, 18 complete and 0 interrupted iterations
list   [  60% ] 1 VUs  0d00h00m54.9s/24h0m0s  18/30 iters, 30 per VU

running (0d00h00m56.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h00m55.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h00m57.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h00m56.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h00m58.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h00m57.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h00m59.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m58.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m00.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h00m59.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m01.0s), 1/1 VUs, 20 complete and 0 interrupted iterations
list   [  67% ] 1 VUs  0d00h01m00.9s/24h0m0s  20/30 iters, 30 per VU

running (0d00h01m02.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h01m01.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h01m03.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h01m02.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h01m04.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h01m03.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h01m05.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h01m04.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h01m06.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h01m05.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h01m07.0s), 1/1 VUs, 22 complete and 0 interrupted iterations
list   [  73% ] 1 VUs  0d00h01m06.9s/24h0m0s  22/30 iters, 30 per VU

running (0d00h01m08.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h01m07.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h01m09.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h01m08.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h01m10.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h01m09.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h01m11.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h01m10.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h01m12.0s), 1/1 VUs, 24 complete and 0 interrupted iterations
list   [  80% ] 1 VUs  0d00h01m11.9s/24h0m0s  24/30 iters, 30 per VU

running (0d00h01m13.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h01m12.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h01m14.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h01m13.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h01m15.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h01m14.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h01m16.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h01m15.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h01m17.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h01m16.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h01m18.0s), 1/1 VUs, 26 complete and 0 interrupted iterations
list   [  87% ] 1 VUs  0d00h01m17.9s/24h0m0s  26/30 iters, 30 per VU

running (0d00h01m19.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h01m18.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h01m20.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h01m19.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h01m21.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h01m20.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h01m22.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h01m21.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h01m23.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h01m22.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h01m24.0s), 1/1 VUs, 28 complete and 0 interrupted iterations
list   [  93% ] 1 VUs  0d00h01m23.9s/24h0m0s  28/30 iters, 30 per VU

running (0d00h01m25.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h01m24.9s/24h0m0s  29/30 iters, 30 per VU

running (0d00h01m26.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h01m25.9s/24h0m0s  29/30 iters, 30 per VU

running (0d00h01m27.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h01m26.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing rbac.authorization.k8s.io.rolebindings from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 3061      ✗ 0   
     data_received..................: 357 MB  4.1 MB/s
     data_sent......................: 1.2 MB  14 kB/s
     http_req_blocked...............: avg=10.24µs  min=220ns   med=260ns   max=7.13ms  p(90)=331ns    p(95)=350ns  
     http_req_connecting............: avg=1.98µs   min=0s      med=0s      max=1.36ms  p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=47.43ms  min=10.28ms med=46.1ms  max=91.13ms p(90)=57.78ms  p(95)=62.2ms 
       { expected_response:true }...: avg=47.43ms  min=10.28ms med=46.1ms  max=91.13ms p(90)=57.78ms  p(95)=62.2ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 1531
     http_req_receiving.............: avg=1.27ms   min=47.48µs med=1.26ms  max=3.54ms  p(90)=1.78ms   p(95)=1.93ms 
     http_req_sending...............: avg=376.72µs min=34.91µs med=50.1µs  max=7.61ms  p(90)=631.98µs p(95)=3.01ms 
     http_req_tls_handshaking.......: avg=6.69µs   min=0s      med=0s      max=4ms     p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=45.77ms  min=9.97ms  med=44.47ms max=88.06ms p(90)=55.64ms  p(95)=60.31ms
     http_reqs......................: 1531    17.525146/s
     iteration_duration.............: avg=2.81s    min=95.69ms med=2.9s    max=2.98s   p(90)=2.96s    p(95)=2.96s  
     iterations.....................: 30      0.343406/s
     vus............................: 1       min=1       max=1 
     vus_max........................: 1       min=1       max=1 


running (0d00h01m27.4s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h01m27.3s/24h0m0s  30/30 iters, 30 per VU